Config/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедениеВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВедениеВзаиморасчетовПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализацииУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьПроведениеПриЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Служебный, для объединения с УТ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСуммуЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоКурсуНаДатуСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеОбъемовПеревозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПредметыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДоговораПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПредметыДоговоровПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыВУсловныхЕдиницах</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокументаЗаказЗаявка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ) Тип цен по умолчанию для оформления покупок по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяДепозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидДокументаПоЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидСДПоЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыСопроводительныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДопустимоеЧислоДнейЗадолженности</Name>
					<Comment>Отсрочка оплаты по задолженности, дней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособРасчетаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУсловиеВозникновенияЗадолженности</Name>
					<Comment>0 - Предоплата, 1 - Доставка груза, 2 - Получение документов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыСопроводительныхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыСопроводительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеКонтроля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатУсловияКонтроляСопроводительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейНаОбработку</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводственныйКалендарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатЭтапыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВариантОтсчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыОтсчетаДатыПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСрок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПроизводственныйКалендарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидСопроводительногоДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыСопроводительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/HTTPServices/ExternalAPI_mdep/Ext/Module.bsl
Функция ПолучитьПозициюПервогоРазделителяДаты(ДатаСтрокой)

	ПозицияПервогоРазделителя = 0;
	СтрокаЦифр = "0123456789";
	ДлинаСтроки = СтрДлина(ДатаСтрокой);
	Для й=1 По ДлинаСтроки Цикл
		ТекущийСимвол = Сред(ДатаСтрокой,й,1);
		Если СтрНайти(СтрокаЦифр,ТекущийСимвол) = 0 Тогда 
			ПозицияПервогоРазделителя = й;			
			Прервать;
		КонецЕсли;		
	КонецЦикла;	  
	
	Возврат ПозицияПервогоРазделителя;
	
КонецФункции	


Функция ПолучитьДатуИзСтроки(СтрокаСДатой) Экспорт

	ДатаСтрокой = СокрЛП(СтрокаСДатой);
	
	Если ДатаСтрокой = "" Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;	
	
	Если СтрДлина(ДатаСтрокой) = 19 Тогда 
		// 2021-09-05 06:59:51
		
		Год = Число(Лев(ДатаСтрокой,4));
		Месяц = Число(Сред(ДатаСтрокой,6,2));
		День = Число(Сред(ДатаСтрокой,9,2));
		Час = Число(Сред(ДатаСтрокой,12,2));
		Минута = Число(Сред(ДатаСтрокой,15,2));
		Секунда = Число(Сред(ДатаСтрокой,18,2));
		
		ДатаДатой = Дата(Год, Месяц, День, Час, Минута, Секунда);
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 10 Тогда
		
		ПозицияПервогоРазделителя = ПолучитьПозициюПервогоРазделителяДаты(ДатаСтрокой);		
		Если ПозицияПервогоРазделителя = 3 Тогда		

			// 05.11.2019
			
			День = Число(Лев(ДатаСтрокой,2));
			Месяц = Число(Сред(ДатаСтрокой,4,2));
			Год = Число(Сред(ДатаСтрокой,7,4));
			
		ИначеЕсли ПозицияПервогоРазделителя = 5 Тогда			
			
			// 2019-11-05
			Год = Число(Лев(ДатаСтрокой,4));
			Месяц = Число(Сред(ДатаСтрокой,6,2));
			День = Число(Сред(ДатаСтрокой,9,2));
			
		КонецЕсли;	
		
		ДатаДатой = Дата(Год, Месяц, День);
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 7 Тогда 
		//01.2019
		
		День = 1;
		Месяц = Число(Лев(ДатаСтрокой,2));
		Год = Число(Сред(ДатаСтрокой,4));
		
		ДатаДатой = Дата(Год, Месяц, День);
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 8 Тогда 
		//13112020
		
		День = Число(Лев(ДатаСтрокой,2));
		Месяц = Число(Сред(ДатаСтрокой,3,2));
		Год = Число(Сред(ДатаСтрокой,5));
		
		ДатаДатой = Дата(Год, Месяц, День);
		
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 12 Тогда 	
		
		//4 кв.2012 г.
		//3 кв.2012 г.

		НомерКвартала = Число(Лев(ДатаСтрокой,1));
		Год = Число(Сред(ДатаСтрокой,6,4));
		
		ДатаДатой = КонецМесяца(Дата(Год, НомерКвартала*3, 1));
		

	Иначе	
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат ДатаДатой;

КонецФункции		



//Функция ContractListGet(Запрос)
//	Ответ = Новый HTTPСервисОтвет(200);
//	Возврат Ответ;
//КонецФункции

Функция ПолучитьIdДокумента(Регистратор)

	ТипДокумента = "НЕТ";
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ТипДокумента = "ПРС";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ТипДокумента = "ПКО";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") Тогда
		ТипДокумента = "ОПК";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОперацияБух") Тогда
		ТипДокумента = "ОПЕ";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ТипДокумента = "РТУ";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		ТипДокумента = "КДО";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ТипДокумента = "КРЕ";
	КонецЕсли;	
	
	IdДокумента	= ТипДокумента + "-" + СокрЛП(Регистратор.Номер) + "-" + Формат(Регистратор.Дата,"ДФ=dd-MM-yyyy");
	
	Возврат IdДокумента;
	
КонецФункции	


Функция ПолучитьСтруктуруКонтрагента(ВыборкаДетальныеЗаписи) Экспорт
	
	//Контрагенты
	
	//public class TypeOfContractorDTO
	//{
	//    public int Id { get; set; }
	//    public string Name { get; set; }
	//}
	
	//public class ContractorDTO
	//{
	//    public int Id { get; set; }
	//    public string NameFull { get; set; }
	//    public string NameSmall { get; set; }
	//    public string Family { get; set; }
	//    public string Name { get; set; }
	//    public string MiddleName { get; set; }
	//    public string Address { get; set; }
	//    public string PassportSeria { get; set; }
	//    public string PassportNumber { get; set; }
	//    public string PassportKemVidan { get; set; }
	//    public DateTime? PassportDate { get; set; }
	//    public string PassportPlaceOfBirth { get; set; }
	//    public int TypeOfContractorId { get; set; }
	//    public TypeOfContractorDTO TypeOfContractor { get; set; }
	//    public string SNILS { get; set; }
	//    public string INN { get; set; }
	//    public string KPP { get; set; }
	//    public string IKTO { get; set; }
	//    public string OGRN { get; set; }
	//    public string OKPO { get; set; }
	//    public string OKVED { get; set; }
	//}
	
	СтруктураКонтрагента = Новый Структура;
	СтруктураКонтрагента.Вставить("Id", ВыборкаДетальныеЗаписи.КонтрагентКод);
	СтруктураКонтрагента.Вставить("NameFull", ВыборкаДетальныеЗаписи.КонтрагентНаименованиеПолное);		
	СтруктураКонтрагента.Вставить("NameSmall", ВыборкаДетальныеЗаписи.КонтрагентНаименование);
	//СтруктураКонтрагента.Вставить("Family","");
	//СтруктураКонтрагента.Вставить("Name","");
	//СтруктураКонтрагента.Вставить("MiddleName","");
	СтруктураКонтрагента.Вставить("Address",ВыборкаДетальныеЗаписи.КонтрагентЮрАдрес);
	//СтруктураКонтрагента.Вставить("PassportSeria","");
	//СтруктураКонтрагента.Вставить("PassportNumber","");
	//СтруктураКонтрагента.Вставить("PassportKemVidan","");
	//СтруктураКонтрагента.Вставить("PassportDate","");
	//СтруктураКонтрагента.Вставить("PassportPlaceOfBirth","");
	СтруктураКонтрагента.Вставить("TypeOfContractorId",ВыборкаДетальныеЗаписи.ТипКонтрагента);
	
	//Тип контрагента
	СтруктураТипКонтрагента = Новый Структура;
	СтруктураТипКонтрагента.Вставить("Id",ВыборкаДетальныеЗаписи.ТипКонтрагента);		
	СтруктураТипКонтрагента.Вставить("Name",ВыборкаДетальныеЗаписи.ТипКонтрагентаНаименование);		
	СтруктураКонтрагента.Вставить("TypeOfContractor", СтруктураТипКонтрагента);
	
	//СтруктураКонтрагента.Вставить("SNILS","");
	СтруктураКонтрагента.Вставить("INN", ВыборкаДетальныеЗаписи.КонтрагентИНН);
	СтруктураКонтрагента.Вставить("KPP", ВыборкаДетальныеЗаписи.КонтрагентКПП);
	//СтруктураКонтрагента.Вставить("IKTO","");
	//СтруктураКонтрагента.Вставить("OGRN","");
	СтруктураКонтрагента.Вставить("OKPO", ВыборкаДетальныеЗаписи.КонтрагентКодПоОКПО);
	//СтруктураКонтрагента.Вставить("OKVED","");
	
	Возврат СтруктураКонтрагента;	
	
КонецФункции


#Область ОбработчикиСобытий

Функция ContractListGet(Запрос)

	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	//УстановитьПривилегированныйРежим(Истина);
	//ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеБанковскихСчетов();
	//
	//Возврат Ответ(ПубликуемыеДанные);
	
	

	// Получить из запроса параметр URL *.
	//Признак = Запрос.ПараметрыURL["*"];
	
	КоличествоЗаписей = Запрос.ПараметрыЗапроса.Получить("CountOfRecords");
	ДоговорКод = Запрос.ПараметрыЗапроса.Получить("Id");  
	 
	// Сформировать выборку договоров
	
	ЗапросДоговоры = Новый Запрос;
	ЗапросДоговоры.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Код КАК Код,
		|	ДоговорыКонтрагентов.Наименование КАК Наименование,
		|	ДоговорыКонтрагентов.Владелец.Код КАК КонтрагентКод,
		|	ДоговорыКонтрагентов.Владелец.Наименование КАК КонтрагентНаименование,
		|	ДоговорыКонтрагентов.Владелец.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
		|	ДоговорыКонтрагентов.Владелец.ИНН КАК КонтрагентИНН,
		|	ДоговорыКонтрагентов.Владелец.КПП КАК КонтрагентКПП,
		|	ДоговорыКонтрагентов.Владелец.КодПоОКПО КАК КонтрагентКодПоОКПО,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентов.Владелец.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
		|			ТОГДА 2
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДоговорыКонтрагентов.Владелец.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|					ТОГДА 3
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТипКонтрагента,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентов.Владелец.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
		|			ТОГДА ""Юридическое лицо""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ДоговорыКонтрагентов.Владелец.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|					ТОГДА ""Индивидуальный предприниматель""
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТипКонтрагентаНаименование,
		|	ДоговорыКонтрагентов.Владелец.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
		|	ДоговорыКонтрагентов.Дата КАК Дата,
		|	ДоговорыКонтрагентов.Номер КАК Номер,
		|	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
		|	ДоговорыКонтрагентов.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(ВложенныйЗапросКонтрагентыКонтактнаяИнформация.Представление, """") КАК КонтрагентЮрАдрес
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
		|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ГДЕ
		|			КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|			И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)) КАК ВложенныйЗапросКонтрагентыКонтактнаяИнформация
		|		ПО ДоговорыКонтрагентов.Владелец = ВложенныйЗапросКонтрагентыКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ДоговорыКонтрагентов.ЭтоГруппа = ЛОЖЬ
		|	И ДоговорыКонтрагентов.ВидВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.РасчетыЗаЭлектроэнергиюСЮридическимиЛицами)
		|	И ДоговорыКонтрагентов.Код = &ДоговорКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Ссылка КАК Ссылка,
		|	ВТ_Договоры.Код КАК ДоговорКод,
		|	ВТ_Договоры.Наименование КАК ДоговорНаименование,
		|	ВТ_Договоры.КонтрагентКод КАК КонтрагентКод,
		|	ВТ_Договоры.КонтрагентНаименование КАК КонтрагентНаименование,
		|	ВТ_Договоры.КонтрагентНаименованиеПолное КАК КонтрагентНаименованиеПолное,
		|	ВТ_Договоры.КонтрагентИНН КАК КонтрагентИНН,
		|	ВТ_Договоры.КонтрагентКПП КАК КонтрагентКПП,
		|	ВТ_Договоры.КонтрагентКодПоОКПО КАК КонтрагентКодПоОКПО,
		|	ВТ_Договоры.ТипКонтрагента КАК ТипКонтрагента,
		|	ВТ_Договоры.ТипКонтрагентаНаименование КАК ТипКонтрагентаНаименование,
		|	ВТ_Договоры.КонтрагентЮрАдрес КАК КонтрагентЮрАдрес,
		|	ВТ_Договоры.Дата КАК ДоговорДата,
		|	ВТ_Договоры.Номер КАК ДоговорНомер,
		|	ВТ_Договоры.СрокДействия КАК ДоговорСрокДействия,
		|	ВТ_Договоры.Комментарий КАК ДоговорКомментарий
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|ГДЕ
		|	ВТ_Договоры.Дата <= &ТекущаяДата
		|	И (ВТ_Договоры.СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ ВТ_Договоры.СрокДействия >= &ТекущаяДата)";
	
	ЗапросДоговоры.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Если КоличествоЗаписей <> Неопределено Тогда	
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КоличествоЗаписей) Тогда
			КоличествоЗаписей = 1;			
		КонецЕсли;	
		ЗапросДоговоры.Текст = СтрЗаменить(ЗапросДоговоры.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Строка(КоличествоЗаписей));
	КонецЕсли;	
	
	Если ДоговорКод <> Неопределено Тогда
		ЗапросДоговоры.УстановитьПараметр("ДоговорКод", ДоговорКод);
	Иначе	
		ЗапросДоговоры.Текст = СтрЗаменить(ЗапросДоговоры.Текст, "И ДоговорыКонтрагентов.Код = &ДоговорКод", "");
	КонецЕсли;	
	
	
	РезультатЗапроса = ЗапросДоговоры.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		
		//Контрагенты
		СтруктураКонтрагента = ПолучитьСтруктуруКонтрагента(ВыборкаДетальныеЗаписи);		
		
		//Договоры

		//public class ContractDTO
		//{
		//    public int Id { get; set; }
		//    public string Number { get; set; }
		//    public int ContractorId { get; set; }
		//    public ContractorDTO Contractor { get; set; }
		//    public DateTime? DateRegister { get; set; }
		//    public DateTime? DateStart { get; set; }
		//    public DateTime? DateEnd { get; set; }
		//    public bool IsClose { get; set; }
		//    public DateTime? DateClose { get; set; }
		//    public string Note { get; set; }
		//}
		
		СтруктураЗаписи = Новый Структура; 
		СтруктураЗаписи.Вставить("Id", ВыборкаДетальныеЗаписи.ДоговорКод);
		СтруктураЗаписи.Вставить("Number", ВыборкаДетальныеЗаписи.ДоговорНомер);		
		СтруктураЗаписи.Вставить("ContractorId", ВыборкаДетальныеЗаписи.КонтрагентКод);
		СтруктураЗаписи.Вставить("Contractor", СтруктураКонтрагента);
		СтруктураЗаписи.Вставить("ContractName", ВыборкаДетальныеЗаписи.ДоговорНаименование);
		//СтруктураЗаписи.Вставить("DateRegister", ВыборкаДетальныеЗаписи.ДоговорДата);
		СтруктураЗаписи.Вставить("DateStart", ВыборкаДетальныеЗаписи.ДоговорДата);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДоговорСрокДействия) Тогда
			СтруктураЗаписи.Вставить("DateEnd", ВыборкаДетальныеЗаписи.ДоговорСрокДействия);
		Иначе
			СтруктураЗаписи.Вставить("DateEnd", Неопределено);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДоговорСрокДействия) Тогда
			Если ВыборкаДетальныеЗаписи.ДоговорСрокДействия <= ТекущаяДата() Тогда
				СтруктураЗаписи.Вставить("IsClose", Ложь);
			Иначе	                                      
				СтруктураЗаписи.Вставить("IsClose", Истина);
			КонецЕсли;
			
			СтруктураЗаписи.Вставить("DateClose", ВыборкаДетальныеЗаписи.ДоговорСрокДействия);	
			
		Иначе
			СтруктураЗаписи.Вставить("IsClose", Ложь);
			СтруктураЗаписи.Вставить("DateClose", Неопределено);
		КонецЕсли;	
		
		СтруктураЗаписи.Вставить("Note", ВыборкаДетальныеЗаписи.ДоговорКомментарий);

		Массив.Добавить(СтруктураЗаписи);
		
	КонецЦикла;	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;	
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO; 
	
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Массив, НастройкиСериализацииJSON);    
	Результат = ЗаписьJSON.Закрыть();
	
	// Сформировать ответ, возвращаемый HTTP-сервисом.
	Ответ = Новый HTTPСервисОтвет(200);
	
	// Установить тело ответа из строки Результат.
	Ответ.УстановитьТелоИзСтроки(Результат);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	Возврат Ответ;
	
КонецФункции


Функция PaymentsGet(Запрос)  
	
	//Пример запроса
	//http://192.168.10.3/ACC_2020/hs/api_ges/Payments?StartDate=01012022&EndDate=31012022&ContractId=00-006491
	// Сформировать ответ, возвращаемый HTTP-сервисом.
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	НачальнаяДата = Запрос.ПараметрыЗапроса.Получить("StartDate");
	КонечнаяДата = Запрос.ПараметрыЗапроса.Получить("EndDate");  
	КонтрагентКод = Запрос.ПараметрыЗапроса.Получить("ContractorId");  
	ДоговорКод = Запрос.ПараметрыЗапроса.Получить("ContractId");  
	
	Если НачальнаяДата = Неопределено Тогда
		Возврат Ответ;
	Иначе
		НачальнаяДата = ПолучитьДатуИзСтроки(НачальнаяДата);		
	КонецЕсли;	
	
	Если КонечнаяДата = Неопределено Тогда
		Возврат Ответ;
	Иначе
		КонечнаяДата = ПолучитьДатуИзСтроки(КонечнаяДата);		
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
		|	ХозрасчетныйОбороты.Регистратор.Номер КАК РегистраторНомер,
		|	ХозрасчетныйОбороты.Регистратор.Дата КАК РегистраторДата,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Регистратор.Комментарий КАК СТРОКА(200)) КАК РегистраторКомментарий,
		|	ХозрасчетныйОбороты.Субконто1.Наименование КАК КонтрагентНаименование,
		|	ХозрасчетныйОбороты.Субконто2 КАК ДоговорКонтрагента,
		|	ХозрасчетныйОбороты.Субконто2.Код КАК ДоговорКонтрагентаКод,
		|	ХозрасчетныйОбороты.Субконто2.Наименование КАК ДоговорКонтрагентаНаименование,
		|	ХозрасчетныйОбороты.Субконто3 КАК Документ,
		|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)),
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И Субконто1.Код = &КонтрагентКод
		|				И Субконто2.Код = &ДоговорКод,
		|			КорСчет В ИЕРАРХИИ (&КорСчет),
		|			) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.СуммаОборотКт <> 0
		|	И ХозрасчетныйОбороты.Субконто2.ВидВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.РасчетыЗаЭлектроэнергиюСЮридическимиЛицами)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорКонтрагента
		|ИТОГИ
		|	СУММА(СуммаОборотКт)
		|ПО
		|	ОБЩИЕ,
		|	Регистратор,
		|	ДоговорКонтрагента
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачальнаяДата));	
	
	МоментКонечнаяДата = Новый Граница(КонецДня(КонечнаяДата), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("КонецПериода", МоментКонечнаяДата);
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	Запрос.УстановитьПараметр("ВидыСубконто", МассивСубконто);
	
	МассивКорСчет = Новый Массив;
	МассивКорСчет.Добавить(ПланыСчетов.Хозрасчетный.КассаОрганизации);  //50.01
	МассивКорСчет.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);  //51
	МассивКорСчет.Добавить(ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам);  //57.03
	Запрос.УстановитьПараметр("КорСчет", МассивКорСчет);

	Если КонтрагентКод = Неопределено Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Субконто1.Код = &КонтрагентКод", "");
	Иначе                                                                                
		Запрос.УстановитьПараметр("КонтрагентКод", КонтрагентКод);
	КонецЕсли;	
		
	Если ДоговорКод = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Субконто2.Код = &ДоговорКод", "");
	Иначе                                                                                
		Запрос.УстановитьПараметр("ДоговорКод", ДоговорКод);
	КонецЕсли;	
	
	Результат = Запрос.Выполнить(); 

		//Платежи
		//"Payment": {
		//"Id": string,
		//"ContractId": string,
		//"DatePay": string,
		//"Summa": number,
		//"Note": string,
		//"SaleDocumentId": string | number, 		// идентификатор документа к которому привязана оплата
		//"SaleDocument": saleDocument
		//},

	ОбщийИтог = 0;		
	МассивИтоговый = Новый Массив;
	
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 
	ВыборкаПоРегистратору = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоРегистратору.Следующий() Цикл 

		СтруктураПлатежа = Новый Структура;

		СтруктураРегистратор = Новый Структура; 
		СтруктураРегистратор.Вставить("Id", ПолучитьIdДокумента(ВыборкаПоРегистратору.Регистратор));
		СтруктураРегистратор.Вставить("DatePay", ВыборкаПоРегистратору.РегистраторДата);
		СтруктураРегистратор.Вставить("Note", ВыборкаПоРегистратору.РегистраторКомментарий);
		
		МассивДоговоры = Новый Массив;
		ВыборкаПоДоговоруКонтрагента = ВыборкаПоРегистратору.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоДоговоруКонтрагента.Следующий() Цикл 
			
			СтруктураДоговор = Новый Структура;
			СтруктураДоговор.Вставить("ContractId", ВыборкаПоДоговоруКонтрагента.ДоговорКонтрагентаКод);			
			
			МассивДокументы = Новый Массив;
			ВыборкаПоДокументу = ВыборкаПоДоговоруКонтрагента.Выбрать(); 
			Пока ВыборкаПоДокументу.Следующий() Цикл 
				
				СтруктураДокумент = Новый Структура;
				СтруктураДокумент.Вставить("SaleDocumentId", ПолучитьIdДокумента(ВыборкаПоДокументу.Документ));			
				СтруктураДокумент.Вставить("Summa", ВыборкаПоДокументу.СуммаОборотКт);			
				МассивДокументы.Добавить(СтруктураДокумент);
				ОбщийИтог = ОбщийИтог + ВыборкаПоДокументу.СуммаОборотКт;		
				
			КонецЦикла; 
			
			СтруктураДоговор.Вставить("SaleDocuments", МассивДокументы);
			МассивДоговоры.Добавить(СтруктураДоговор);
	
		КонецЦикла;                      
		
		СтруктураРегистратор.Вставить("Contracts", МассивДоговоры);
		СтруктураПлатежа.Вставить("Payment", СтруктураРегистратор);
		
		МассивИтоговый.Добавить(СтруктураПлатежа);
		
	КонецЦикла; 
	
	//Для отладки строка с итогом
	СтруктураИтоговаяСумма = Новый Структура;
	СтруктураИтоговаяСумма.Вставить("GrangTotal", ОбщийИтог);			
	МассивИтоговый.Добавить(СтруктураИтоговаяСумма);  
	//
	
	СтруктураПлатежи = Новый Структура;
	СтруктураПлатежи.Вставить("Payments", МассивИтоговый); 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;	
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO; 
	
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураПлатежи, НастройкиСериализацииJSON);    
	Результат = ЗаписьJSON.Закрыть();
	
	// Сформировать ответ, возвращаемый HTTP-сервисом.
	//Ответ = Новый HTTPСервисОтвет(200);
	
	// Установить тело ответа из строки Результат.
	Ответ.УстановитьТелоИзСтроки(Результат);
	//Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	Возврат Ответ;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Ответ(Данные)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.Заголовки["Cache-Control"] = "no-cache";
	
	ДанныеJSON = ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ПолучитьДанныеJSON(Данные);
	Ответ.УстановитьТелоИзСтроки(ДанныеJSON);
	
	Возврат Ответ;
	
КонецФункции

Функция СоответствиеИзСтрокиJSON(Строка)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	Ответ = ПрочитатьJSON(ЧтениеJSON, Истина);
	Возврат Ответ
	
КонецФункции

Функция AccrualsGet(Запрос)   
	
	//Пример запроса
	//http://192.168.10.3/ACC_2020/hs/api_ges/Accruals?StartDate=01012022&EndDate=31012022&ContractId=00-006300
	// Сформировать ответ, возвращаемый HTTP-сервисом.
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	НачальнаяДата = Запрос.ПараметрыЗапроса.Получить("StartDate");
	КонечнаяДата = Запрос.ПараметрыЗапроса.Получить("EndDate");  
	КонтрагентКод = Запрос.ПараметрыЗапроса.Получить("ContractorId");  
	ДоговорКод = Запрос.ПараметрыЗапроса.Получить("ContractId");  
	
	Если НачальнаяДата = Неопределено Тогда
		Возврат Ответ;
	Иначе
		НачальнаяДата = ПолучитьДатуИзСтроки(НачальнаяДата);		
	КонецЕсли;	
	
	Если КонечнаяДата = Неопределено Тогда
		Возврат Ответ;
	Иначе
		КонечнаяДата = ПолучитьДатуИзСтроки(КонечнаяДата);		
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст =    
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер КАК РеализацияНомер,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК РеализацияДата,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент.Код КАК КонтрагентКод,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент.Наименование КАК КонтрагентНаименование,
	|	РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента.Код КАК ДоговорКонтрагентаКод,
	|	РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК НоменклатураКод,
	|	РеализацияТоваровУслугТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	|	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента.ВидВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.РасчетыЗаЭлектроэнергиюСЮридическимиЛицами)
	|	И РеализацияТоваровУслугТовары.Ссылка.Контрагент.Код = &КонтрагентКод
	|	И РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента.Код = &ДоговорКод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.Ссылка.Номер,
	|	РеализацияТоваровУслугУслуги.Ссылка.Дата,
	|	РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	|	РеализацияТоваровУслугУслуги.Ссылка.Контрагент.Код,
	|	РеализацияТоваровУслугУслуги.Ссылка.Контрагент.Наименование,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.Код,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.Наименование,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.Номенклатура.Код,
	|	РеализацияТоваровУслугУслуги.Номенклатура.Наименование,
	|	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Цена,
	|	РеализацияТоваровУслугУслуги.Сумма,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация
	|	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.ВидВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.РасчетыЗаЭлектроэнергиюСЮридическимиЛицами)
	|	И РеализацияТоваровУслугУслуги.Ссылка.Контрагент.Код = &КонтрагентКод
	|	И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.Код = &ДоговорКод
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаВсего)
	|ПО
	|	ОБЩИЕ,
	|	РеализацияТоваровУслуг
	|АВТОУПОРЯДОЧИВАНИЕ";
		
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачальнаяДата));	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонечнаяДата));
	
	Если КонтрагентКод = Неопределено Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РеализацияТоваровУслугТовары.Ссылка.Контрагент.Код = &КонтрагентКод", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РеализацияТоваровУслугУслуги.Ссылка.Контрагент.Код = &КонтрагентКод", "");
	Иначе                                                                                
		Запрос.УстановитьПараметр("КонтрагентКод", КонтрагентКод);
	КонецЕсли;	
		
	Если ДоговорКод = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента.Код = &ДоговорКод", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.Код = &ДоговорКод", "");
	Иначе                                                                                
		Запрос.УстановитьПараметр("ДоговорКод", ДоговорКод);
	КонецЕсли;	
	
	Результат = Запрос.Выполнить(); 

	// начисления
//	"SaleDocument": {
//	"Id": string | number,					// уникальный идентификатор
//	"Number": string,						// номер документа
//	"Month": string							// месяц за который выставлен документ
//	"Year": string							// год за который выставлен документ
//	"CreateDate": string,					// дата создания начисления
//	"MeteringDeviceId": string | number,	// идентификатор прибора учета
//	"Volume": number,						// объем
//	"PaymentSumma": number,					// сумма к оплате
//	"PreviousReading": number,				// предыдущие показания
//	"CurrentReading": number,				// показания по которым выставлен документ
//	"TariffId": string | number,			// идентификатор тарифной зоны
//	"Tariff": {									// тарифная зона
//		"Id": string | number					// уникальный идентификатор
//		"Zone": string,							// название тарифной зоны
//		"Value": number,						// цена за единицу
//	},
//}                              

	ОбщийИтог = 0;		
	МассивИтоговый = Новый Массив;
	
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаОбщийИтог.Следующий(); 
	ВыборкаПоРеализацииТоваровУслуг = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаПоРеализацииТоваровУслуг.Следующий() Цикл 

		СтруктураРеализации = Новый Структура;

		СтруктураДокумент = Новый Структура; 
		СтруктураДокумент.Вставить("Id", ПолучитьIdДокумента(ВыборкаПоРеализацииТоваровУслуг.РеализацияТоваровУслуг));
		СтруктураДокумент.Вставить("Number", ВыборкаПоРеализацииТоваровУслуг.РеализацияНомер);
		СтруктураДокумент.Вставить("Month", Месяц(ВыборкаПоРеализацииТоваровУслуг.РеализацияДата));
		СтруктураДокумент.Вставить("Year", Год(ВыборкаПоРеализацииТоваровУслуг.РеализацияДата)); 
		СтруктураДокумент.Вставить("CreateDate", ВыборкаПоРеализацииТоваровУслуг.РеализацияДата); 
		СтруктураДокумент.Вставить("ContractorId", ВыборкаПоРеализацииТоваровУслуг.КонтрагентКод);
		СтруктураДокумент.Вставить("ContractId", ВыборкаПоРеализацииТоваровУслуг.ДоговорКонтрагентаКод);
		
		МассивНоменклатура = Новый Массив;
		ВыборкаПоНоменклатуре = ВыборкаПоРеализацииТоваровУслуг.Выбрать(); 
		Пока ВыборкаПоНоменклатуре.Следующий() Цикл 
				
			СтруктураНоменклатура = Новый Структура;
			СтруктураНоменклатура.Вставить("ItemId", ВыборкаПоНоменклатуре.НоменклатураКод);			
			СтруктураНоменклатура.Вставить("ItemName", ВыборкаПоНоменклатуре.НоменклатураНаименование);			
			СтруктураНоменклатура.Вставить("Unit", ВыборкаПоНоменклатуре.ЕдиницаИзмерения);			
			СтруктураНоменклатура.Вставить("Amount", ВыборкаПоНоменклатуре.Количество);			
			СтруктураНоменклатура.Вставить("Price", ВыборкаПоНоменклатуре.Цена);			
			СтруктураНоменклатура.Вставить("Summa", ВыборкаПоНоменклатуре.Сумма);			
			СтруктураНоменклатура.Вставить("VATRate", Строка(ВыборкаПоНоменклатуре.СтавкаНДС));			
			СтруктураНоменклатура.Вставить("VATSumma", ВыборкаПоНоменклатуре.СуммаНДС);			
			СтруктураНоменклатура.Вставить("TotalSumma", ВыборкаПоНоменклатуре.СуммаВсего);			
			
			МассивНоменклатура.Добавить(СтруктураНоменклатура);
			ОбщийИтог = ОбщийИтог + ВыборкаПоНоменклатуре.СуммаВсего;		
				
		КонецЦикла; 
		
		СтруктураДокумент.Вставить("Items", МассивНоменклатура);
		СтруктураРеализации.Вставить("SaleDocument", СтруктураДокумент);
		
		МассивИтоговый.Добавить(СтруктураРеализации);
		
	КонецЦикла; 
	
	//Для отладки строка с итогом
	//СтруктураИтоговаяСумма = Новый Структура;
	//СтруктураИтоговаяСумма.Вставить("GrandTotal", ОбщийИтог);			
	//МассивИтоговый.Добавить(СтруктураИтоговаяСумма);  
	//
	
	СтруктураДокументовРеализации = Новый Структура;
	СтруктураДокументовРеализации.Вставить("SaleDocuments", МассивИтоговый); 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;	
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO; 
	
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокументовРеализации, НастройкиСериализацииJSON);    
	Результат = ЗаписьJSON.Закрыть();
	
	// Сформировать ответ, возвращаемый HTTP-сервисом.
	//Ответ = Новый HTTPСервисОтвет(200);
	
	// Установить тело ответа из строки Результат.
	Ответ.УстановитьТелоИзСтроки(Результат);
	//Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	Возврат Ответ;

КонецФункции

Функция RouteDataGet(Запрос)
	
	//Пример запроса
	//http://localhost/UAT/hs/api_uat/RouteData?StartDate=01.10.2022&EndDate=31.10.2022
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ДанныеПоМаршрутам = ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ВыгрузитьДанныеПоМаршрутамПутевыхЛистов(Запрос);
	
	Возврат Ответ(ДанныеПоМаршрутам);

КонецФункции

Функция ПолучитьНовуюСтруктуруСтроки()
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Период", Дата(1,1,1));
	СтруктураСтроки.Вставить("ПутевойЛистНомер", "");
	
	СтруктураСтроки.Вставить("ОрганизацияИдентификатор", "");
	СтруктураСтроки.Вставить("ОрганизацияНаименование", "");

	СтруктураСтроки.Вставить("ТранспортноеСредствоИдентификатор", "");
	СтруктураСтроки.Вставить("ТранспортноеСредствоНаименование", "");   
	СтруктураСтроки.Вставить("ТранспортноеСредствоМодельНаименование", "");   
		
	СтруктураСтроки.Вставить("МаршрутИдентификатор", "");
	СтруктураСтроки.Вставить("МаршрутНаименование", "");

	СтруктураСтроки.Вставить("СотрудникИдентификатор", "");
	СтруктураСтроки.Вставить("СотрудникНаименование", "");
		
	СтруктураСтроки.Вставить("РабочееВремя", 0); 
	СтруктураСтроки.Вставить("Выручка", 0); 
	СтруктураСтроки.Вставить("КоличествоПассажиров", 0); 
	СтруктураСтроки.Вставить("КоличествоЕздок", 0); 
	СтруктураСтроки.Вставить("ПробегСПассажирами", 0); 
	
	Возврат СтруктураСтроки;
	
КонецФункции	

Функция FuelConsumptionGet(Запрос)

	//Пример запроса
	//http://localhost/UAT/hs/api_uat/FuelConsumption?StartDate=01.03.2023&EndDate=31.03.2023
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПотреблениеТоплива = ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ВыгрузитьПотреблениеТоплива(Запрос);
	
	Возврат Ответ(ПотреблениеТоплива);   
	
КонецФункции

Функция ItemsWriteOffGet(Запрос)

	//Пример запроса
	//http://localhost/UAT/hs/api_uat/ItemsWriteOff?StartDate=01.04.2023&EndDate=30.04.2023
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	СписаниеМатериалов = ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ВыгрузитьСписаниеМатериалов(Запрос);
	
	Возврат Ответ(СписаниеМатериалов);   
	
КонецФункции

Функция TechFluidsConsumptionGet(Запрос)

	//Пример запроса
	//http://localhost/UAT/hs/api_uat/TechFluidsConsumption?StartDate=01.05.2023&EndDate=31.05.2023
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	РасходТехническихЖидкостей = ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ВыгрузитьРасходТехническихЖидкостей(Запрос);
	
	Возврат Ответ(РасходТехническихЖидкостей);   

КонецФункции

Функция EmployeePOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);

	//Получаем данные из тела запроса
	СтрокаСотрудникиJSON = Запрос.ПолучитьТелоКакСтроку();
	
	//Передаем данные (JSON строку) в общий модуль для создания сотрудников
	ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ЗагрузитьСотрудниковJSON(СтрокаСотрудникиJSON);
	
	Возврат Ответ;
	
КонецФункции

Функция EmployeeGET(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	
	Результат = ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ПолучитьСписокСотрудников(Запрос);	
	
	// Установить тело ответа из строки Результат.
	Ответ.УстановитьТелоИзСтроки(Результат);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	Возврат Ответ;
	
КонецФункции

Функция EmployeeSnilsWritePOST(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);

	//Получаем данные из тела запроса
	СтрокаСотрудникиJSON = Запрос.ПолучитьТелоКакСтроку();
	
	//Передаем данные (JSON строку) в общий модуль для записи СНИЛС для физлиц
	ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ЗаписатьСНИЛСJSON(СтрокаСотрудникиJSON);
	
	Возврат Ответ;

КонецФункции

Функция StorageDocumentsPOST(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);

	//Получаем данные из тела запроса
	СтрокаСкладскиеДокументыJSON = Запрос.ПолучитьТелоКакСтроку();
	
	//Передаем данные (JSON-строку) в общий модуль для создания объектов
	ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ЗагрузитьСкладскиеДокументыJSON(СтрокаСкладскиеДокументыJSON);
	
	Возврат Ответ;
	
КонецФункции

Функция StorageDocumentsGET(Запрос)

	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	СписокСкладскихДокументов = ЮЦАУ_ВнешнийПрограммныйИнтерфейс.ВыгрузитьСписокСкладскихДокументов(Запрос);
	
	Возврат Ответ(СписокСкладскихДокументов);   
	
КонецФункции

#КонецОбласти
